---
kind: method
id: M:Autodesk.Revit.DB.FormattedText.#ctor
source: html/955fef3d-d39a-69e0-efea-3195003858de.htm
---
# Autodesk.Revit.DB.FormattedText.#ctor Method

Creates a new default FormattedText object, which contains only a carriage return character and has no formatting.

## Syntax (C#)
```csharp
public FormattedText()
```